---
kind: method
id: M:Autodesk.Revit.DB.KeyBasedTreeEntries.GetEnumerator
source: html/f9c29052-23ec-6ea6-5294-b2efb1350508.htm
---
# Autodesk.Revit.DB.KeyBasedTreeEntries.GetEnumerator Method

Returns an enumerator that iterates through a collection.

## Syntax (C#)
```csharp
public virtual IEnumerator<KeyBasedTreeEntry> GetEnumerator()
```

## Returns
An IEnumerator object that can be used to iterate through the collection.